artifacts/ai-event-k6-11k-console-1787106752.txt
time="2026-08-19T10:37:45+08:00" level=warning msg="SSLKEYLOGFILE was specified, logging TLS connection keys to 'D:\\ssl_key\\sslog.log'..." test_path="file:///E:/Codebase/Cortex/backend/loadtest/ai_event_claim_100k.js"

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: backend/loadtest/ai_event_claim_100k.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 20m30s max duration (incl. graceful stop):
              * mixed_claims: 11000 iterations shared among 2000 VUs (maxDuration: 20m0s, gracefulStop: 30s)


running (00m00.8s), 2000/2000 VUs, 0 complete and 0 interrupted iterations
mixed_claims   [   0% ] 2000 VUs  00m00.8s/20m0s  00000/11000 shared iters

running (00m01.8s), 2000/2000 VUs, 0 complete and 0 interrupted iterations
mixed_claims   [   0% ] 2000 VUs  00m01.8s/20m0s  00000/11000 shared iters

running (00m02.8s), 2000/2000 VUs, 81 complete and 0 interrupted iterations
mixed_claims   [   1% ] 2000 VUs  00m02.8s/20m0s  00081/11000 shared iters

running (00m03.8s), 2000/2000 VUs, 213 complete and 0 interrupted iterations
mixed_claims   [   2% ] 2000 VUs  00m03.8s/20m0s  00213/11000 shared iters

running (00m04.8s), 2000/2000 VUs, 319 complete and 0 interrupted iterations
mixed_claims   [   3% ] 2000 VUs  00m04.8s/20m0s  00319/11000 shared iters

running (00m05.8s), 2000/2000 VUs, 443 complete and 0 interrupted iterations
mixed_claims   [   4% ] 2000 VUs  00m05.8s/20m0s  00443/11000 shared iters

running (00m06.8s), 2000/2000 VUs, 555 complete and 0 interrupted iterations
mixed_claims   [   5% ] 2000 VUs  00m06.8s/20m0s  00555/11000 shared iters

running (00m07.8s), 2000/2000 VUs, 669 complete and 0 interrupted iterations
mixed_claims   [   6% ] 2000 VUs  00m07.8s/20m0s  00669/11000 shared iters

running (00m08.8s), 2000/2000 VUs, 766 complete and 0 interrupted iterations
mixed_claims   [   7% ] 2000 VUs  00m08.8s/20m0s  00766/11000 shared iters

running (00m09.8s), 2000/2000 VUs, 882 complete and 0 interrupted iterations
mixed_claims   [   8% ] 2000 VUs  00m09.8s/20m0s  00882/11000 shared iters

running (00m10.8s), 2000/2000 VUs, 991 complete and 0 interrupted iterations
mixed_claims   [   9% ] 2000 VUs  00m10.8s/20m0s  00991/11000 shared iters

running (00m11.8s), 2000/2000 VUs, 1106 complete and 0 interrupted iterations
mixed_claims   [  10% ] 2000 VUs  00m11.8s/20m0s  01106/11000 shared iters

running (00m12.8s), 2000/2000 VUs, 1203 complete and 0 interrupted iterations
mixed_claims   [  11% ] 2000 VUs  00m12.8s/20m0s  01203/11000 shared iters

running (00m13.8s), 2000/2000 VUs, 1306 complete and 0 interrupted iterations
mixed_claims   [  12% ] 2000 VUs  00m13.8s/20m0s  01306/11000 shared iters

running (00m14.8s), 2000/2000 VUs, 1416 complete and 0 interrupted iterations
mixed_claims   [  13% ] 2000 VUs  00m14.8s/20m0s  01416/11000 shared iters

running (00m15.8s), 2000/2000 VUs, 1541 complete and 0 interrupted iterations
mixed_claims   [  14% ] 2000 VUs  00m15.8s/20m0s  01541/11000 shared iters

running (00m16.8s), 2000/2000 VUs, 1657 complete and 0 interrupted iterations
mixed_claims   [  15% ] 2000 VUs  00m16.8s/20m0s  01657/11000 shared iters

running (00m17.8s), 2000/2000 VUs, 1773 complete and 0 interrupted iterations
mixed_claims   [  16% ] 2000 VUs  00m17.8s/20m0s  01773/11000 shared iters

running (00m18.8s), 2000/2000 VUs, 1891 complete and 0 interrupted iterations
mixed_claims   [  17% ] 2000 VUs  00m18.8s/20m0s  01891/11000 shared iters

running (00m19.8s), 2000/2000 VUs, 1999 complete and 0 interrupted iterations
mixed_claims   [  18% ] 2000 VUs  00m19.8s/20m0s  01999/11000 shared iters

running (00m20.8s), 2000/2000 VUs, 2125 complete and 0 interrupted iterations
mixed_claims   [  19% ] 2000 VUs  00m20.8s/20m0s  02125/11000 shared iters

running (00m21.8s), 2000/2000 VUs, 2234 complete and 0 interrupted iterations
mixed_claims   [  20% ] 2000 VUs  00m21.8s/20m0s  02234/11000 shared iters

running (00m22.8s), 2000/2000 VUs, 2369 complete and 0 interrupted iterations
mixed_claims   [  22% ] 2000 VUs  00m22.8s/20m0s  02369/11000 shared iters

running (00m23.8s), 2000/2000 VUs, 2491 complete and 0 interrupted iterations
mixed_claims   [  23% ] 2000 VUs  00m23.8s/20m0s  02491/11000 shared iters

running (00m24.8s), 2000/2000 VUs, 2603 complete and 0 interrupted iterations
mixed_claims   [  24% ] 2000 VUs  00m24.8s/20m0s  02603/11000 shared iters

running (00m25.8s), 2000/2000 VUs, 2729 complete and 0 interrupted iterations
mixed_claims   [  25% ] 2000 VUs  00m25.8s/20m0s  02729/11000 shared iters

running (00m26.8s), 2000/2000 VUs, 2858 complete and 0 interrupted iterations
mixed_claims   [  26% ] 2000 VUs  00m26.8s/20m0s  02858/11000 shared iters

running (00m27.8s), 2000/2000 VUs, 2974 complete and 0 interrupted iterations
mixed_claims   [  27% ] 2000 VUs  00m27.8s/20m0s  02974/11000 shared iters

running (00m28.8s), 2000/2000 VUs, 3076 complete and 0 interrupted iterations
mixed_claims   [  28% ] 2000 VUs  00m28.8s/20m0s  03076/11000 shared iters

running (00m29.8s), 2000/2000 VUs, 3217 complete and 0 interrupted iterations
mixed_claims   [  29% ] 2000 VUs  00m29.8s/20m0s  03217/11000 shared iters

running (00m30.8s), 2000/2000 VUs, 3350 complete and 0 interrupted iterations
mixed_claims   [  30% ] 2000 VUs  00m30.8s/20m0s  03350/11000 shared iters

running (00m31.8s), 2000/2000 VUs, 3490 complete and 0 interrupted iterations
mixed_claims   [  32% ] 2000 VUs  00m31.8s/20m0s  03490/11000 shared iters

running (00m32.8s), 2000/2000 VUs, 3612 complete and 0 interrupted iterations
mixed_claims   [  33% ] 2000 VUs  00m32.8s/20m0s  03612/11000 shared iters

running (00m33.8s), 2000/2000 VUs, 3703 complete and 0 interrupted iterations
mixed_claims   [  34% ] 2000 VUs  00m33.8s/20m0s  03703/11000 shared iters

running (00m34.8s), 2000/2000 VUs, 3812 complete and 0 interrupted iterations
mixed_claims   [  35% ] 2000 VUs  00m34.8s/20m0s  03812/11000 shared iters

running (00m35.8s), 2000/2000 VUs, 3933 complete and 0 interrupted iterations
mixed_claims   [  36% ] 2000 VUs  00m35.8s/20m0s  03933/11000 shared iters

running (00m36.8s), 2000/2000 VUs, 4045 complete and 0 interrupted iterations
mixed_claims   [  37% ] 2000 VUs  00m36.8s/20m0s  04045/11000 shared iters

running (00m37.8s), 2000/2000 VUs, 4182 complete and 0 interrupted iterations
mixed_claims   [  38% ] 2000 VUs  00m37.8s/20m0s  04182/11000 shared iters

running (00m38.8s), 2000/2000 VUs, 4281 complete and 0 interrupted iterations
mixed_claims   [  39% ] 2000 VUs  00m38.8s/20m0s  04281/11000 shared iters

running (00m39.8s), 2000/2000 VUs, 4405 complete and 0 interrupted iterations
mixed_claims   [  40% ] 2000 VUs  00m39.8s/20m0s  04405/11000 shared iters

running (00m40.8s), 2000/2000 VUs, 4530 complete and 0 interrupted iterations
mixed_claims   [  41% ] 2000 VUs  00m40.8s/20m0s  04530/11000 shared iters

running (00m41.8s), 2000/2000 VUs, 4664 complete and 0 interrupted iterations
mixed_claims   [  42% ] 2000 VUs  00m41.8s/20m0s  04664/11000 shared iters

running (00m42.8s), 2000/2000 VUs, 4782 complete and 0 interrupted iterations
mixed_claims   [  43% ] 2000 VUs  00m42.8s/20m0s  04782/11000 shared iters

running (00m43.8s), 2000/2000 VUs, 4891 complete and 0 interrupted iterations
mixed_claims   [  44% ] 2000 VUs  00m43.8s/20m0s  04891/11000 shared iters

running (00m44.8s), 2000/2000 VUs, 5031 complete and 0 interrupted iterations
mixed_claims   [  46% ] 2000 VUs  00m44.8s/20m0s  05031/11000 shared iters

running (00m45.8s), 2000/2000 VUs, 5157 complete and 0 interrupted iterations
mixed_claims   [  47% ] 2000 VUs  00m45.8s/20m0s  05157/11000 shared iters

running (00m46.8s), 2000/2000 VUs, 5273 complete and 0 interrupted iterations
mixed_claims   [  48% ] 2000 VUs  00m46.8s/20m0s  05273/11000 shared iters

running (00m47.8s), 2000/2000 VUs, 5384 complete and 0 interrupted iterations
mixed_claims   [  49% ] 2000 VUs  00m47.8s/20m0s  05384/11000 shared iters

running (00m48.8s), 2000/2000 VUs, 5497 complete and 0 interrupted iterations
mixed_claims   [  50% ] 2000 VUs  00m48.8s/20m0s  05497/11000 shared iters

running (00m49.8s), 2000/2000 VUs, 5617 complete and 0 interrupted iterations
mixed_claims   [  51% ] 2000 VUs  00m49.8s/20m0s  05617/11000 shared iters

running (00m50.8s), 2000/2000 VUs, 5762 complete and 0 interrupted iterations
mixed_claims   [  52% ] 2000 VUs  00m50.8s/20m0s  05762/11000 shared iters

running (00m51.8s), 2000/2000 VUs, 5920 complete and 0 interrupted iterations
mixed_claims   [  54% ] 2000 VUs  00m51.8s/20m0s  05920/11000 shared iters

running (00m52.8s), 2000/2000 VUs, 5974 complete and 0 interrupted iterations
mixed_claims   [  54% ] 2000 VUs  00m52.8s/20m0s  05974/11000 shared iters

running (00m53.8s), 2000/2000 VUs, 6019 complete and 0 interrupted iterations
mixed_claims   [  55% ] 2000 VUs  00m53.8s/20m0s  06019/11000 shared iters

running (00m54.8s), 2000/2000 VUs, 6076 complete and 0 interrupted iterations
mixed_claims   [  55% ] 2000 VUs  00m54.8s/20m0s  06076/11000 shared iters

running (00m55.8s), 2000/2000 VUs, 6225 complete and 0 interrupted iterations
mixed_claims   [  57% ] 2000 VUs  00m55.8s/20m0s  06225/11000 shared iters

running (00m56.8s), 2000/2000 VUs, 6374 complete and 0 interrupted iterations
mixed_claims   [  58% ] 2000 VUs  00m56.8s/20m0s  06374/11000 shared iters

running (00m57.8s), 2000/2000 VUs, 6531 complete and 0 interrupted iterations
mixed_claims   [  59% ] 2000 VUs  00m57.8s/20m0s  06531/11000 shared iters

running (00m58.8s), 2000/2000 VUs, 6664 complete and 0 interrupted iterations
mixed_claims   [  61% ] 2000 VUs  00m58.8s/20m0s  06664/11000 shared iters

running (00m59.8s), 2000/2000 VUs, 6797 complete and 0 interrupted iterations
mixed_claims   [  62% ] 2000 VUs  00m59.8s/20m0s  06797/11000 shared iters

running (01m00.8s), 2000/2000 VUs, 6926 complete and 0 interrupted iterations
mixed_claims   [  63% ] 2000 VUs  01m00.8s/20m0s  06926/11000 shared iters

running (01m01.8s), 2000/2000 VUs, 7055 complete and 0 interrupted iterations
mixed_claims   [  64% ] 2000 VUs  01m01.8s/20m0s  07055/11000 shared iters

running (01m02.8s), 2000/2000 VUs, 7162 complete and 0 interrupted iterations
mixed_claims   [  65% ] 2000 VUs  01m02.8s/20m0s  07162/11000 shared iters

running (01m03.8s), 2000/2000 VUs, 7278 complete and 0 interrupted iterations
mixed_claims   [  66% ] 2000 VUs  01m03.8s/20m0s  07278/11000 shared iters

running (01m04.8s), 2000/2000 VUs, 7408 complete and 0 interrupted iterations
mixed_claims   [  67% ] 2000 VUs  01m04.8s/20m0s  07408/11000 shared iters

running (01m05.8s), 2000/2000 VUs, 7525 complete and 0 interrupted iterations
mixed_claims   [  68% ] 2000 VUs  01m05.8s/20m0s  07525/11000 shared iters

running (01m06.8s), 2000/2000 VUs, 7628 complete and 0 interrupted iterations
mixed_claims   [  69% ] 2000 VUs  01m06.8s/20m0s  07628/11000 shared iters

running (01m07.8s), 2000/2000 VUs, 7750 complete and 0 interrupted iterations
mixed_claims   [  70% ] 2000 VUs  01m07.8s/20m0s  07750/11000 shared iters

running (01m08.8s), 2000/2000 VUs, 7882 complete and 0 interrupted iterations
mixed_claims   [  72% ] 2000 VUs  01m08.8s/20m0s  07882/11000 shared iters

running (01m09.8s), 2000/2000 VUs, 8015 complete and 0 interrupted iterations
mixed_claims   [  73% ] 2000 VUs  01m09.8s/20m0s  08015/11000 shared iters

running (01m10.8s), 2000/2000 VUs, 8140 complete and 0 interrupted iterations
mixed_claims   [  74% ] 2000 VUs  01m10.8s/20m0s  08140/11000 shared iters

running (01m11.8s), 2000/2000 VUs, 8232 complete and 0 interrupted iterations
mixed_claims   [  75% ] 2000 VUs  01m11.8s/20m0s  08232/11000 shared iters

running (01m12.8s), 2000/2000 VUs, 8363 complete and 0 interrupted iterations
mixed_claims   [  76% ] 2000 VUs  01m12.8s/20m0s  08363/11000 shared iters

running (01m13.8s), 2000/2000 VUs, 8483 complete and 0 interrupted iterations
mixed_claims   [  77% ] 2000 VUs  01m13.8s/20m0s  08483/11000 shared iters

running (01m14.8s), 2000/2000 VUs, 8604 complete and 0 interrupted iterations
mixed_claims   [  78% ] 2000 VUs  01m14.8s/20m0s  08604/11000 shared iters

running (01m15.8s), 2000/2000 VUs, 8728 complete and 0 interrupted iterations
mixed_claims   [  79% ] 2000 VUs  01m15.8s/20m0s  08728/11000 shared iters

running (01m16.8s), 2000/2000 VUs, 8832 complete and 0 interrupted iterations
mixed_claims   [  80% ] 2000 VUs  01m16.8s/20m0s  08832/11000 shared iters

running (01m17.8s), 2000/2000 VUs, 8949 complete and 0 interrupted iterations
mixed_claims   [  81% ] 2000 VUs  01m17.8s/20m0s  08949/11000 shared iters

running (01m18.8s), 1919/2000 VUs, 9081 complete and 0 interrupted iterations
mixed_claims   [  83% ] 2000 VUs  01m18.8s/20m0s  09081/11000 shared iters

running (01m19.8s), 1820/2000 VUs, 9180 complete and 0 interrupted iterations
mixed_claims   [  83% ] 2000 VUs  01m19.8s/20m0s  09180/11000 shared iters

running (01m20.8s), 1690/2000 VUs, 9310 complete and 0 interrupted iterations
mixed_claims   [  85% ] 2000 VUs  01m20.8s/20m0s  09310/11000 shared iters

running (01m21.8s), 1594/2000 VUs, 9406 complete and 0 interrupted iterations
mixed_claims   [  86% ] 2000 VUs  01m21.8s/20m0s  09406/11000 shared iters

running (01m22.8s), 1475/2000 VUs, 9525 complete and 0 interrupted iterations
mixed_claims   [  87% ] 2000 VUs  01m22.8s/20m0s  09525/11000 shared iters

running (01m23.8s), 1361/2000 VUs, 9639 complete and 0 interrupted iterations
mixed_claims   [  88% ] 2000 VUs  01m23.8s/20m0s  09639/11000 shared iters

running (01m24.8s), 1245/2000 VUs, 9755 complete and 0 interrupted iterations
mixed_claims   [  89% ] 2000 VUs  01m24.8s/20m0s  09755/11000 shared iters

running (01m25.8s), 1120/2000 VUs, 9880 complete and 0 interrupted iterations
mixed_claims   [  90% ] 2000 VUs  01m25.8s/20m0s  09880/11000 shared iters

running (01m26.8s), 0025/2000 VUs, 10975 complete and 0 interrupted iterations
mixed_claims   [ 100% ] 2000 VUs  01m26.8s/20m0s  10975/11000 shared iters


  █ THRESHOLDS 

    claim_accepted
    ✓ 'count==10000' count=10000

    claim_ineligible
    ✓ 'count==1000' count=1000

    claim_sold_out
    ✓ 'count==0' count=0

    claim_unexpected
    ✓ 'count==0' count=0

    http_req_duration
    ✗ 'p(95)<10000' p(95)=17.7s
    ✓ 'p(99)<20000' p(99)=18.45s

    http_req_failed
    ✓ 'rate<0.001' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11000   126.396605/s
    checks_succeeded...: 100.00% 11000 out of 11000
    checks_failed......: 0.00%   0 out of 11000

    ✓ mixed claim result is expected

    CUSTOM
    claim_accepted.................: 10000  114.906005/s
    claim_ineligible...............: 1000   11.4906/s
    claim_sold_out.................: 0      0/s
    claim_unexpected...............: 0      0/s

    HTTP
    http_req_duration..............: avg=15.3s  min=1.71s med=16.65s max=19.69s p(90)=17.47s p(95)=17.7s 
      { expected_response:true }...: avg=15.3s  min=1.71s med=16.65s max=19.69s p(90)=17.47s p(95)=17.7s 
    http_req_failed................: 0.00%  0 out of 11000
    http_reqs......................: 11000  126.396605/s

    EXECUTION
    iteration_duration.............: avg=15.34s min=1.91s med=16.66s max=19.84s p(90)=17.48s p(95)=17.71s
    iterations.....................: 11000  126.396605/s
    vus............................: 25     min=25         max=2000
    vus_max........................: 2000   min=2000       max=2000

    NETWORK
    data_received..................: 4.1 MB 47 kB/s
    data_sent......................: 3.6 MB 41 kB/s



running (01m27.0s), 0000/2000 VUs, 11000 complete and 0 interrupted iterations
mixed_claims ✓ [ 100% ] 2000 VUs  01m27.0s/20m0s  11000/11000 shared iters
time="2026-08-19T10:39:14+08:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"